Autodesk.Navisworks.Api.CommentStatus
Specifies status of comment.

Autodesk.Navisworks.Api.CommentStatus.New
Newly created comment.

Autodesk.Navisworks.Api.CommentStatus.Active
Active issue.

Autodesk.Navisworks.Api.CommentStatus.Approved
Issue has been approved.

Autodesk.Navisworks.Api.CommentStatus.Resolved
Issue has been resolved.